content/posts/tiling_window_managers.md
+++
title = "tiling window managers"
author = ["Cameron Smith"]
lastmod = 2020-09-24T23:23:31-04:00
slug = "tiling_window_managers"
draft = false
+++

## <https://news.ycombinator.com/item?id=20795189> {#https-news-dot-ycombinator-dot-com-item-id-20795189}


### I have enjoyed using Contexts <https://contexts.co/> for switching between applications. {#i-have-enjoyed-using-contexts-https-contexts-dot-co-for-switching-between-applications-dot}


### There are a couple of automatic tiling window managers for MacOS, the most notable being Yabai (<https://github.com/koekeishiya/yabai>) and Amethyst (<https://github.com/ianyh/Amethyst>). {#there-are-a-couple-of-automatic-tiling-window-managers-for-macos-the-most-notable-being-yabai--https-github-dot-com-koekeishiya-yabai--and-amethyst--https-github-dot-com-ianyh-amethyst--dot}


### Yabai doesn't handle window switching on its own but it can use SKHD (<https://github.com/koekeishiya/skhd>) or any other application that can bind terminal commands to keyboard shortcuts such as Hammerspoon ([<https://www.hammerspoon.org>](<https://www.hammerspoon.org/>)) or BetterTouchTool ([https://folivora.ai](https://folivora.ai/)) or even Keyboard Maestro. The commands are context-aware of spaces and the placement of windows on the x-y plane so you can move between windows relative to their position on the screen. {#yabai-doesn-t-handle-window-switching-on-its-own-but-it-can-use-skhd--https-github-dot-com-koekeishiya-skhd--or-any-other-application-that-can-bind-terminal-commands-to-keyboard-shortcuts-such-as-hammerspoon--https-www-dot-hammerspoon-dot-org--https-www-dot-hammerspoon-dot-org---or-bettertouchtool--https-folivora-dot-ai--or-even-keyboard-maestro-dot-the-commands-are-context-aware-of-spaces-and-the-placement-of-windows-on-the-x-y-plane-so-you-can-move-between-windows-relative-to-their-position-on-the-screen-dot}
